[
  {
    "id": 1,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSsHgXb8H0k6vx4ykqKj-9-Hcz5JFwPu83xWg&s",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "description": "Facebook helps you connect with friends, family, and communities worldwide. Share updates, photos, videos, and stories to keep people informed about your life. Follow pages, join groups, and participate in discussions on topics you care about. Use Messenger to chat or call privately with friends. Discover news, events, and trending content. Engage with communities and like-minded people easily. Customize your feed and notifications to stay updated. Facebook makes it simple to share your moments, explore content, and stay connected safely and effectively every day with everyone around you.",
    "size": 120,
    "reviews": 142000000,
    "ratingAvg": 4.1,
    "downloads": 22,
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 21000000 },
      { "name": "5 star", "count": 94000000 }
    ]
  },
  {
    "id": 2,
    "image": "https://images.icon-icons.com/1269/PNG/512/1497553304-104_84834.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "description": "Instagram allows you to share photos, videos, and stories with friends, followers, and the wider community. Discover creative content from creators worldwide, follow trends, and explore hashtags. Engage with posts through likes, comments, and shares. Use editing tools to enhance your photos and videos. Save your favorite content and create collections. Communicate privately via direct messages. Instagram helps you express yourself visually, connect with friends and communities, discover new ideas, and stay up-to-date with trends and entertainment every day in an easy and enjoyable way.",
    "size": 110,
    "reviews": 130000000,
    "ratingAvg": 4.3,
    "downloads": 343,
    "ratings": [
      { "name": "1 star", "count": 9000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 87000000 }
    ]
  },
  {
    "id": 3,
    "image": "https://img.freepik.com/premium-vector/circle-whatsapp-logotype-icon-social-media-app-network-application-popular-editorial-brand-vector-illustration_913857-391.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "description": "WhatsApp Messenger offers fast, secure, and reliable messaging worldwide. Send text messages, voice messages, photos, videos, and documents to your contacts easily. Make voice and video calls anytime from anywhere. Create and join group chats for multiple conversations at once. Use end-to-end encryption to keep your communication private. Share location, contacts, and media with ease. WhatsApp allows you to stay connected with friends, family, and colleagues efficiently. Keep conversations organized, communicate safely, and enjoy seamless messaging every day with a simple and user-friendly interface.",
    "size": 90,
    "reviews": 170000000,
    "ratingAvg": 4.5,
    "downloads": 543,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 24000000 },
      { "name": "5 star", "count": 127000000 }
    ]
  },
  {
    "id": 4,
    "image": "https://clipartcraft.com/images/youtube-logo-transparent-circle-9.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube lets you watch, share, and discover videos from creators all over the world. Subscribe to channels to get updates on new content and enjoy trending videos. Watch tutorials, entertainment, music, vlogs, and educational content anytime. Engage with videos by liking, commenting, and sharing them. Create your own channel to upload and share your content with a global audience. Save videos to playlists for offline viewing. YouTube helps you explore, learn, entertain, and share, making it easy to enjoy videos and connect with creators every day in a fun and interactive way.",
    "size": 150,
    "reviews": 155000000,
    "ratingAvg": 4.2,
    "downloads": 700,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 11000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 99000000 }
    ]
  },
  {
    "id": 5,
    "image": "https://static.vecteezy.com/system/resources/thumbnails/042/127/114/small/app-icon-style-tiktok-logo-with-thick-white-border-on-a-transparent-background-free-png.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok allows you to create, watch, and share short, engaging videos worldwide. Explore trending challenges, music clips, and creative content. Engage with posts through likes, comments, and shares. Follow your favorite creators and discover new talent. Use easy-to-use editing tools to add effects, text, and music to your videos. Participate in global trends, express your creativity, and connect with a large community. TikTok makes it simple and fun to entertain, learn new ideas, and engage with people every day while sharing your own content in a creative way.",
    "size": 130,
    "reviews": 120000000,
    "ratingAvg": 4.4,
    "downloads": 242,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 19000000 },
      { "name": "5 star", "count": 81000000 }
    ]
  },
  {
    "id": 6,
    "image": "https://cdn-1.webcatalog.io/catalog/google-maps/google-maps-icon.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps helps you navigate, explore, and discover places worldwide. Get accurate directions for driving, walking, cycling, or public transportation. Check real-time traffic updates and estimated travel times. Explore nearby restaurants, shops, landmarks, and attractions. Read reviews, view photos, and check ratings before visiting. Save favorite locations and create lists for future reference. Google Maps allows you to plan trips efficiently, discover new places, and travel safely. Stay informed, navigate with confidence, and explore the world seamlessly every day using this essential app.",
    "size": 75,
    "reviews": 110000000,
    "ratingAvg": 4.4,
    "downloads": 342,
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 21000000 },
      { "name": "5 star", "count": 72000000 }
    ]
  },
  {
    "id": 7,
    "image": "https://static.vecteezy.com/system/resources/previews/022/613/026/original/google-play-store-icon-logo-symbol-free-png.png",
    "title": "Google Play Store",
    "companyName": "Google LLC",
    "description": "Google Play Store is your gateway to apps, games, movies, books, and other digital content for Android devices. Discover new apps, read reviews, and explore categories to find what you need. Keep your apps updated automatically and enjoy a safe downloading experience. Purchase digital content securely using Google Play payment methods. Manage your apps and subscriptions efficiently. Get personalized recommendations based on your interests. Google Play Store makes it simple to access, download, and enjoy apps and digital media safely every day with convenience and ease.",
    "size": 50,
    "reviews": 100000000,
    "ratingAvg": 4.1,
    "downloads": 344,
    "ratings": [
      { "name": "1 star", "count": 9000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 19000000 },
      { "name": "5 star", "count": 66000000 }
    ]
  },
  {
    "id": 8,
    "image": "https://raw.githubusercontent.com/ali-han/Twitter-x-icon-logo/main/dark/Twitter%20X%20Icon.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "description": "X, formerly Twitter, allows you to follow news, trends, and conversations from around the world. Share your thoughts, photos, and videos through tweets. Engage with posts using likes, retweets, and comments. Follow people, organizations, and topics that interest you. Discover trending hashtags and participate in discussions. Join communities and connect with like-minded people globally. X helps you communicate effectively, stay updated with current events, and express opinions. It is an easy and interactive way to participate in conversations and explore content every day.",
    "size": 85,
    "reviews": 95000000,
    "ratingAvg": 4.0,
    "downloads": 300,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 61000000 }
    ]
  },
  {
    "id": 9,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSvKwUR3hlb-BXlOyq5dXJCWvtG_ZbbtnZd_e-uExlCrxuQIW94JLKzJDorleiZfQW8BXg&usqp=CAU",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "description": "Google Chrome is a fast, secure, and reliable web browser. Browse websites efficiently with multiple tabs, bookmarks, and history. Sync your data across devices for seamless access. Use extensions and tools to enhance productivity and browsing experience. Enjoy built-in security features to keep your information safe. Customize your browsing with themes and settings. Google Chrome makes it easy to search, explore, and interact with content online. Stay connected, browse efficiently, and enjoy a smooth and safe web experience every day on any device.",
    "size": 120,
    "reviews": 125000000,
    "ratingAvg": 4.3,
    "downloads": 677,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 85000000 }
    ]
  },
  {
    "id": 10,
    "image": "https://th.bing.com/th/id/OIP.4uvStL-8jLEwfVmvBQKFhAHaEK?w=325&h=182&c=7&r=0&o=7&cb=12&dpr=1.3&pid=1.7&rm=3",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify lets you stream millions of songs, albums, and podcasts from around the world. Discover new music through playlists, charts, and personalized recommendations. Create your own playlists and save favorite tracks for offline listening. Follow artists and stay updated on new releases. Explore podcasts across various topics. Share your favorite songs with friends. Spotify makes it easy to enjoy music and podcasts, explore new content, and organize your audio experience. Listen anytime, anywhere, and connect with music and creators effortlessly every day.",
    "size": 100,
    "reviews": 105000000,
    "ratingAvg": 4.5,
    "downloads": 345,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 74000000 }
    ]
  },
  {
    "id": 11,
    "image": "https://logos-world.net/wp-content/uploads/2022/05/Google-Photos-Logo.jpg",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "description": "Google Photos allows you to store, organize, and access your photos and videos securely. Automatically back up your media and recover it anytime. Search for photos using AI-powered tags and features. Create albums, collages, and animations effortlessly. Share photos and videos with friends and family. Keep your memories safe and organized. Google Photos helps you explore, relive, and share your moments. Access your media across devices, create highlights, and enjoy a seamless and secure way to manage your digital memories every day.",
    "size": 95,
    "reviews": 97000000,
    "ratingAvg": 4.4,
    "downloads": 743,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 19000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "id": 12,
    "image": "https://images.indianexpress.com/2022/03/Telegram-new-feature.jpg?w=414",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram provides fast, secure, and cloud-based messaging worldwide. Send text messages, photos, videos, and documents easily. Join or create groups and channels to communicate with many people. Secret chats offer end-to-end encryption for privacy. Share media, stickers, and use bots to enhance conversations. Access messages from multiple devices seamlessly. Telegram makes messaging efficient, secure, and interactive. Stay connected with friends, family, and communities globally. Communicate easily, collaborate, and enjoy a fast and secure messaging experience every day using Telegram.",
    "size": 70,
    "reviews": 88000000,
    "ratingAvg": 4.5,
    "downloads": 367,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 63000000 }
    ]
  },
  {
    "id": 13,
    "image": "https://static.vecteezy.com/system/resources/previews/022/613/021/original/google-mail-gmail-icon-logo-symbol-free-png.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Gmail is a fast, secure, and reliable email service. Send and receive messages efficiently from multiple devices. Organize your inbox using labels, filters, and categories. Protect your account with spam detection and security features. Attach files, schedule emails, and use smart replies for convenience. Stay connected with friends, family, and colleagues easily. Gmail makes communication organized, safe, and accessible. Manage emails effectively, search messages quickly, and enjoy a seamless experience for personal or professional communication every day.",
    "size": 85,
    "reviews": 115000000,
    "ratingAvg": 4.3,
    "downloads": 189,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 80000000 }
    ]
  },
  {
    "id": 14,
    "image": "https://logos-world.net/wp-content/uploads/2020/11/Google-Drive-Logo-2020-present.jpg",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "description": "Google Drive offers secure cloud storage for files, documents, photos, and videos. Upload, organize, and access files from anywhere with internet access. Share files and manage permissions with ease. Collaborate on documents, spreadsheets, and presentations in real-time. Backup important data safely. Access your files across devices effortlessly. Google Drive helps you organize, share, and collaborate efficiently. Store media and documents securely, track changes, and manage your content seamlessly. Drive makes file management simple, reliable, and convenient for work or personal use every day.",
    "size": 90,
    "reviews": 94000000,
    "ratingAvg": 4.5,
    "downloads": 900,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 67000000 }
    ]
  },
  {
    "id": 15,
    "image": "https://static.vecteezy.com/system/resources/previews/018/910/721/non_2x/linkedin-logo-linkedin-symbol-linkedin-icon-free-free-vector.jpg",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "description": "LinkedIn helps you connect with professionals, explore job opportunities, and showcase skills. Build a network with colleagues, recruiters, and industry experts. Share posts, updates, and articles to highlight expertise. Follow companies and learn about industry trends. Join groups to discuss and collaborate with like-minded professionals. Receive job alerts and apply for roles seamlessly. LinkedIn helps you grow your professional network, advance your career, and stay informed about your field. Engage with content, connect with opportunities, and build your professional presence effectively every day.",
    "size": 120,
    "reviews": 82000000,
    "ratingAvg": 4.3,
    "downloads": 473,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 13000000 },
      { "name": "5 star", "count": 56000000 }
    ]
  },
  {
    "id": 16,
    "image": "https://static.vecteezy.com/system/resources/previews/022/101/069/large_2x/netflix-logo-transparent-free-png.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "description": "Netflix allows you to watch movies, TV shows, and original content anytime and anywhere. Discover trending and recommended titles based on your interests. Create watchlists, continue watching, and download content for offline viewing. Explore different genres including drama, comedy, action, and documentaries. Stream in high quality and enjoy seamless playback across devices. Share favorite shows with friends. Netflix makes it simple and enjoyable to access entertainment content. Enjoy films, series, and original productions every day while exploring new stories and experiences from around the world.",
    "size": 140,
    "reviews": 89000000,
    "ratingAvg": 4.4,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 63000000 }
    ]
  },
  {
    "id": 17,
    "image": "https://w7.pngwing.com/pngs/832/502/png-transparent-amazon-logo-text-brand-amazon-text-service-retail.png",
    "title": "Amazon Pay",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Pay allows you to make online payments safely and conveniently. Pay bills, send money, and shop across websites and apps that accept Amazon Pay. Store your payment methods securely for faster transactions. Track transactions and manage payments effortlessly. Enjoy trusted and reliable payment processing. Amazon Pay makes online transactions simple, safe, and efficient. Use it for everyday purchases, bills, and financial management. Experience a secure and convenient way to pay, send money, and shop online every day with peace of mind.",
    "size": 120,
    "reviews": 91000000,
    "ratingAvg": 4.5,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 65000000 }
    ]
  },
  {
    "id": 18,
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/718/original/discord-logo-discord-icon-transparent-free-png.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord helps you chat, call, and hang out with friends and communities easily. Join servers, participate in voice and video calls, and share messages, images, and videos. Organize discussions using channels and roles. Use bots and integrations to enhance interactions and gameplay. Stay connected with friends, communities, and interest groups worldwide. Communicate efficiently and engage in collaborative activities. Discord provides a safe and interactive environment to chat, play, and work together. Enjoy a seamless way to stay connected, share content, and collaborate every day.",
    "size": 85,
    "reviews": 67000000,
    "ratingAvg": 4.6,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 51000000 }
    ]
  },
  {
    "id": 19,
    "image": "https://static.vecteezy.com/system/resources/previews/046/861/640/non_2x/google-pay-logo-transparent-background-free-png.png",
    "title": "Google Pay",
    "companyName": "Google LLC",
    "description": "Google Pay allows you to send and receive money quickly and securely. Pay bills, shop online, and manage transactions efficiently. Store your payment methods safely for convenience. Track your spending and transaction history. Use Google Pay across apps, websites, and physical stores that accept it. Make secure and reliable payments anytime. Google Pay simplifies money management, provides safety features, and ensures smooth financial transactions. Stay in control of your finances and make payments conveniently every day with an easy and trusted platform.",
    "size": 70,
    "reviews": 58000000,
    "ratingAvg": 4.5,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 45000000 }
    ]
  },
  {
    "id": 20,
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/2d/bd/ce/2dbdceb4-4be5-c262-cd2b-1037fa993a23/AppIcon-0-0-1x_U007emarketing-0-8-0-0-85-220.png/1200x630wa.png",
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "description": "Uber allows you to request rides and travel safely around the world. Track drivers in real-time, view estimated arrival times, and choose from various ride options. Pay securely through the app and share trip details with friends or family. Access ride history and manage trips easily. Uber provides reliable transportation services for commuting, traveling, or urgent trips. Enjoy a comfortable, safe, and convenient experience. Uber makes getting from one place to another simple, efficient, and accessible every day with professional drivers and trusted service.",
    "size": 100,
    "reviews": 92000000,
    "ratingAvg": 4.2,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 56000000 }
    ]
  }
]
